{
    "name": "Rafanambinantsoa Karim",
    "logo_name": "rafanambinantsoa-karim",
    "role": "Back-end developer",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br> <strong> UN-IT Fianarantsoa </strong> , <br> Pendant mon stage à UN-IT FIanarantsoa en tant que développeur junior, <br> j'ai créé une appli web pour la vente de billets et une app mobile pour le <br>  scan à l'entrée. Ces réalisations ont été cruciales pour valider mon diplôme <br>  de licence en info, enrichissant ma formation théorique par une expérience <br> pratique approfondie. <br><br> <strong>  Direction Régionale des Impôts à Fianarantsoa, </strong> <br> Durant mon stage au Ministère des Finances en tant que Contrôleur des <br>                       impôts, j'ai exploré les rouages de la fiscalité en examinant des dossiers, <br> vérifiant des déclarations et calculant les impôts des contribuables. Cette  <br> expérience, intégrée à ma formation en licence, a enrichi ma                        compréhension théorique par une immersion pratique essentielle."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<br>En tant que développeur backend, je me spécialise dans l'architecture et la mise en place de l'infrastructure centrale des applications, assurant une communication fluide entre le serveur et l'interface utilisateur. <br><br> Bien que ma spécialité réside dans la conception robuste des systèmes serveur, je suis également capable de m'adapter et de collaborer pour compléter les aspects frontaux. <br><br> Mon expertise réside dans la conception de bases de données évolutives, l'optimisation des processus de récupération des données et la mise en place de protocoles sécurisés pour garantir l'intégrité et la fiabilité du système. Je suis passionné par la création d'algorithmes efficaces et l'utilisation des dernières technologies pour optimiser les performances et améliorer l'expérience globale de l'utilisateur."
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<br>Je propose bien plus que des compétences techniques ; mon adaptabilité, ma capacité à résoudre les problèmes et ma facilité à collaborer avec des équipes pluridisciplinaires enrichissent chaque projet avec lequel je m'engage. Mon engagement pour l'apprentissage continu me permet de rester agile dans un paysage technologique en constante évolution, favorisant l'innovation et promouvant des solutions durables."
                    }
                }
            },
            "personal-info": {
                "title": "personal-info",
                "icon": "icons/info-personal.svg",
                "info": { 
                    "bio": {
                        "title": "bio",
                        "description": "<br> About me <br> j'ai exploré le développement web pendant les deux dernières années, en me concentrant sur la création d'expériences utilisateur intuitives. <br> <br> Récemment, j'ai également commencé à explorer le développement mobile, cherchant à élargir mes horizons dans ce domaine dynamique. <br> Ma maîtrise du développement backend me permet de comprendre en profondeur les systèmes, mais je suis tout aussi enthousiaste à l'idée de m'adapter aux exigences du développement frontend si nécessaire, car je crois fermement à l'importance de la polyvalence dans ce domaine en constante évolution."
                    },
                    "interests": {
                        "title": "interests",
                        "description": "<br>Je suis constamment en apprentissage, explorant de nouvelles technologies et méthodologies pour améliorer mes compétences et rester à jour dans ce domaine en perpétuelle évolution. En dehors du codage, je trouve du réconfort et du plaisir dans les jeux vidéo, un espace où je me détends et stimule ma créativité et ma réflexion stratégique. C'est un moyen pour moi de décompresser et de me ressourcer."
                    },
                    "education": {
                        "title": "education",
                        "description": "<br> <u>Mes parcours </u> :   <br><br> 2020 - 2023 =>  <br> EMIT (Ecole de Management et d'Innovation Technologique) Fianarantsoa <br><br>   - <strong>Troisième année de licence</strong> <br> <i>Technologies avancées et Frameworks </i> : Exploration approfondie des technologies émergentes et des frameworks utilisés dans le domaine de l'informatique. <br> <i> Stage de 3 mois et Mémoire de fin d'études </i> :  Intégration des connaissances acquises dans un cadre professionnel, développement de compétences pratiques, et rédaction d'un mémoire de fin d'études portant sur une problématique innovante du domaine informatique. <br><br>   - <strong> Deuxième année de licence </strong> <br> <i> Programmation et Programmation Orientée Objet (POO)  </i>:  Découverte des langages de programmation et leur utilisation dans un contexte orienté objet. Apprentissage pratique à travers des projets. <br> <i>Stage de 2 mois</i> : Application des connaissances acquises dans un environnement professionnel, renforçant la compréhension des langages de programmation et du développement logiciel. <br><br> - <strong> Première année de licence </strong> <br> <i> Bases de l'informatique  </i> : Apprentissage des concepts fondamentaux, notamment les systèmes d'exploitation, les algorithmes et les structures de données. <br> <i> Réalisations </i> : Excellente maîtrise des concepts de base de l'informatique. <br><br> 2018 - 2019 => Collège Saint François Xavier Fianarantsoa ( CSFX) <br><br> <strong> Baccalauréat Série D - Mention Assez Bien </strong>",
                        "files": {
                            "high-school": "I have been in 'Las viñas'...",
                            "university": "The university..."
                        }
                    }
                }
            },
            "hobbies-info": {
                "title": "hobbies-info",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "sports": {
                        "title": "sports",
                        "description": "<br>Je suis un passionné de sport et j'ai une véritable passion pour le basketball, pratiquant régulièrement pour améliorer mes compétences sur le terrain. De plus, je m'adonne à une routine de course à pied le matin, trouvant à la fois la sérénité et l'énergie dans mes sessions de jogging quotidiennes. Ces activités contribuent non seulement à mon bien-être physique, mais elles m'insufflent également discipline et concentration au quotidien."
                    },
                    "favorite-games": {
                        "title": "favorite-games",
                        "description": "<br>Je suis un joueur passionné, trouvant mon équilibre entre la compétitivité de Free Fire, le défi intellectuel des échecs, et l'apaisement dans la musique. Free Fire m'immerge dans des batailles en ligne stimulantes, les échecs me poussent à exercer ma réflexion stratégique, tandis que la musique me permet de me détendre et de trouver de l'inspiration. Ces activités sont pour moi des échappatoires relaxantes, m'offrant un équilibre parfait entre défis ludiques et moments de détente."
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "contacts",
            "sources": {
                "email": "tsukasashishiosama@gmail",
                "phone": "+261 34 41 458 55"
            }
        },
        "social": {
            "github": {
                "title": "Github profile",
                "url": "https://github.com/",
                "user": "Rafanambinantsoa"
            },
            "facebook": {
                "title": "Facebook profile",
                "url": "https://facebook.com/",
                "user": "tsukasa.zeldris"
            },
            "twitter": {
                "title": "Twitter account",
                "url": "https://twitter.com/",
                "user": "username"
            },
            "instagram": {
                "title": "Instagram account",
                "url": "https://instagram.com/",
                "user": "akutagawa_karim"
            }
        },
        "find_me_also_in": {
            "title": "find-me-also-in",
            "sources": {
                "linkedin": {
                    "title": "Linkedin profile",
                    "url": "rafanambinantsoa-kim-5a5508279",
                    "user": ""
                },
                "github": {
                    "title": "Github profile",
                    "url": "https://github.com/",
                    "user": "Rafanambinantsoa"
                },
                "instagram": {
                    "title": "Instagram account",
                    "url": "https://instagram.com/",
                    "user": "akutagawa_karim"
                },
                "facebook":{
                    "title": "Facebook profile",
                    "url": "https://facebook.com/",
                    "user": "tsukasa.zeldris"
                }
            }
        }
    },
    "gists": {
        "1": "1f74d1fa53b617a7a760580a30c91048",
        "2": "7783e4b86dbb9470a9a20a12962eef4f"
    },
    "projects": {
        "1": {
            "title": "EventPass",
            "description": "Une plateforme web gère la vente de billets pour les événements, tandis qu'une app mobile dédiée au scan assure l'accès à ces événements via les codes QR.",
            "img": "/mia.png",
            "tech": ["NuxtJs"],
            "url": "https://github.com/"
        },
        "2": {
            "title": "SymfonyCuisine",
            "description": "Mon projet Symfony permet de créer et partager des recettes en utilisant divers ingrédients de manière flexible entre plusieurs créateurs.",
            "img": "/trinity.png",
            "tech": ["Symfony"],
            "url": "https://github.com/"
        },
        "3": {
            "title": "KimLogement",
            "description":"Une app web pour ventes immobilières : l'admin valide les comptes des agents. Ces agents postent des maisons à vendre et les clients peuvent consulter et acheter.",
            "img": "/estate.png",
            "tech": ["Laravel"],
            "url": "https://github.com/"
        },
        "4": {
            "title": "E-Commerce",
            "description":"Une app mobile dédiée à la vente de fournitures tech, offrant une large gamme de produits technologiques pour les passionnés de tech et les utilisateurs à la recherche d'articles high-tech.",
            "img": "/appVente.png",
            "tech": ["Flutter"],
            "url": "https://github.com/"
        },
        "5": {
            "title": "DeclarImpot",
            "description":"Une application web pour déclarer ses impôts en ligne de manière efficace et simple.",
            "img": "/impot.png",
            "tech": ["Laravel"],
            "url": "https://github.com/"
        },
        "6": {
            "title": "Coming Soon",
            "description": "Coming Soon",
            "img": "/images/projects/ethereum.png",
            "tech": ["NuxtJs"],
            "url": "https://github.com/"
        }
    }
}